[
  {
    "id": 1,
    "userId": "1",
    "author": "Олена Петрова",
    "title": "Напружена і захоплююча історія",
    "movieTitle": "Місто примар",
    "date": "2024-01-15",
    "sentiment": "positive",
    "rating": 4.5,
    "content": "Це був один із найкращих фільмів, які я бачила останнім часом. Сюжет тримав у напрузі до самого кінця. Актори зіграли на високому рівні. Особливо хочеться виділити головну героїню, яка додала емоційності та динаміки історії. Звуковий супровід був просто чудовий, допомагаючи створювати атмосферу таємничості. Я навіть декілька разів лякалася, хоча зазвичай не боюсь жахів. Рекомендую цей фільм усім шанувальникам жанру. Він вартий вашої уваги!",
    "reactions": [1, 2, 3],
    "comments": [
      {
        "id": 1,
        "userId": "2",
        "content": "Цілком погоджуюсь, фільм неймовірний!"
      },
      {
        "id": 2,
        "userId": "4",
        "content": "Мені здається, кінцівка могла бути цікавішою."
      }
    ],
    "countComments": 2,
    "countLikes": 20,
    "countDislikes": 3
  },
  {
    "id": 2,
    "userId": "2",
    "author": "Ігор Коваленко",
    "title": "Досить передбачувано",
    "movieTitle": "Втеча у часі",
    "date": "2024-01-20",
    "sentiment": "neutral",
    "rating": 3,
    "content": "Фільм мав хороший потенціал, але сюжет був трохи передбачуваним. Візуальні ефекти вражають, але історії бракувало емоційної глибини. Деякі сцени виглядали затягнутими, що трохи зіпсувало загальне враження. Герої були добре прописані, але їхні дії часом здавалися нелогічними. Саундтрек гарний, хоча й не особливо запам'ятовується. Загалом це непоганий вибір для легкого вечора, але чогось більшого чекати не варто. Більше уваги сюжету могло зробити його кращим.",
    "reactions": [4, 5],
    "comments": [
      {
        "id": 3,
        "userId": "3",
        "content": "Згодна, ефекти чудові, але очікувала більшого від сюжету."
      }
    ],
    "countComments": 1,
    "countLikes": 12,
    "countDislikes": 5
  },
  {
    "id": 3,
    "userId": "3",
    "author": "Марина Данилюк",
    "title": "Несподіваний поворот подій",
    "movieTitle": "Зірковий детектив",
    "date": "2024-02-01",
    "sentiment": "positive",
    "rating": 4.7,
    "content": "Цей фільм був справжньою знахідкою для мене! Захоплюючий сюжет, де кожна деталь мала значення, тримав у напрузі до останньої хвилини. Головний герой чудово виконав свою роль, передаючи складний характер та внутрішні переживання. Особливо сподобалась кінцівка, яка змусила задуматися. Візуальні ефекти та музика доповнили загальну атмосферу. Немає нічого зайвого, все гармонійно і продумано. Такі фільми варто дивитися кілька разів, щоб помітити всі приховані деталі. Рекомендую його кожному, хто любить детективи та фантастику!",
    "reactions": [1, 2],
    "comments": [
      {
        "id": 4,
        "userId": "2",
        "content": "Повністю згоден, фільм перевершив очікування!"
      }
    ],
    "countComments": 1,
    "countLikes": 30,
    "countDislikes": 1
  },
  {
    "id": 4,
    "userId": "4",
    "author": "Анна Романюк",
    "title": "Фільм, який змушує задуматися",
    "movieTitle": "Загублений світ",
    "date": "2024-02-05",
    "sentiment": "positive",
    "rating": 4.8,
    "content": "Дивовижний фільм, який відкриває новий погляд на життя. Експедиція до джунглів вразила своїм масштабом та деталізацією. Доісторичні створіння виглядали настільки реалістично, що іноді забувала, що це всього лише комп'ютерна графіка. Акторська гра була на високому рівні, особливо варто відзначити лідера експедиції, який додав історії глибини. Саундтрек гармонійно поєднувався з візуальними ефектами, створюючи неймовірну атмосферу пригоди. Це кіно варто переглянути хоча б один раз. Воно надовго залишиться у пам'яті.",
    "reactions": [1, 3, 5],
    "comments": [
      {
        "id": 5,
        "userId": "3",
        "content": "Згоден, графіка дійсно вражає!"
      }
    ],
    "countComments": 1,
    "countLikes": 25,
    "countDislikes": 2
  },
  {
    "id": 5,
    "userId": "5",
    "author": "Сергій Мельник",
    "title": "Тепла драма з несподіваним фіналом",
    "movieTitle": "Тіні минулого",
    "date": "2024-02-10",
    "sentiment": "positive",
    "rating": 4.6,
    "content": "Ця драма була як подорож у минуле, яка дозволяє переосмислити багато речей. Головна героїня була настільки переконливою, що відчував її емоції на собі. Сюжет поданий просто, але з великою глибиною. Кінцівка виявилась абсолютно несподіваною, що зробило історію ще цікавішою. Операторська робота заслуговує окремої похвали, адже кожна сцена виглядала як витвір мистецтва. Рекомендую цей фільм усім, хто любить історії, що торкають душу.",
    "reactions": [2, 4],
    "comments": [
      {
        "id": 6,
        "userId": "4",
        "content": "Ця кінцівка дійсно перевершила мої очікування!"
      }
    ],
    "countComments": 1,
    "countLikes": 18,
    "countDislikes": 4
  },

  {
    "id": 6,
    "userId": "6",
    "author": "Олексій Кравець",
    "title": "Справжній вибух емоцій",
    "movieTitle": "Мелодії серця",
    "date": "2024-02-20",
    "sentiment": "positive",
    "rating": 4.9,
    "content": "Фільм просто неймовірний! Емоції від перегляду залишаться зі мною надовго. Музика, що звучала протягом усього фільму, торкалася найглибших струн душі. Актори вклали душу у свої ролі, а сцени виглядали настільки живими, що я відчував себе частиною цієї історії. Особливо хочу відзначити операторську роботу — кожен кадр був справжнім витвором мистецтва. Якщо шукаєте щось для натхнення, цей фільм ідеально підійде!",
    "reactions": [1, 2, 5],
    "comments": [
      {
        "id": 7,
        "userId": "4",
        "content": "Мені теж дуже сподобалась музика, вона була чарівною!"
      }
    ],
    "countComments": 1,
    "countLikes": 35,
    "countDislikes": 2
  },
  {
    "id": 7,
    "userId": "6",
    "author": "Олексій Кравець",
    "title": "Нестандартний підхід до класики",
    "movieTitle": "Переосмислення",
    "date": "2024-02-25",
    "sentiment": "neutral",
    "rating": 3.8,
    "content": "Фільм зацікавив своїм незвичним поглядом на класичну історію, але враження залишилося змішаним. З одного боку, стиль і візуалізація дійсно вражають, але сюжет здався трохи заплутаним. Герої іноді діяли не зовсім логічно, через що складно було співпереживати. Саундтрек гармонійно доповнював атмосферу, але мені бракувало сильнішої кульмінації. Загалом це цікавий експеримент, але не зовсім те, чого я очікувала.",
    "reactions": [3, 4],
    "comments": [
      {
        "id": 8,
        "userId": "6",
        "content": "Згоден, трохи заплутано, але все ж варто переглянути."
      }
    ],
    "countComments": 1,
    "countLikes": 22,
    "countDislikes": 6
  },
  {
    "id": 8,
    "userId": "7",
    "author": "Юлія Соловей",
    "title": "Фільм, який змушує сміятися",
    "movieTitle": "Сміхотерапія",
    "date": "2024-03-01",
    "sentiment": "positive",
    "rating": 4.2,
    "content": "Це був справжній подарунок для шанувальників комедій! Жарти були дотепними та актуальними, і я не могла перестати сміятися протягом усього перегляду. Акторський склад працював злагоджено, створюючи незабутню хімію на екрані. Деякі моменти могли б бути менш передбачуваними, але це не зіпсувало загального враження. Якщо вам потрібен гарний настрій, сміливо дивіться цей фільм!",
    "reactions": [1, 5],
    "comments": [
      {
        "id": 9,
        "userId": "6",
        "content": "Найкраща комедія, яку я бачив за останній рік!"
      }
    ],
    "countComments": 1,
    "countLikes": 28,
    "countDislikes": 3
  },
  {
    "id": 9,
    "userId": "8",
    "author": "Дмитро Горбач",
    "title": "Суміш наукової фантастики та драми",
    "movieTitle": "Край галактики",
    "date": "2024-03-10",
    "sentiment": "positive",
    "rating": 4.4,
    "content": "Неймовірне поєднання наукової фантастики та драми! Фільм змусив мене задуматися про важливість вибору та ціну, яку ми платимо за свої рішення. Спецефекти були на високому рівні, але найсильніше мене вразила гра акторів. Кінцівка залишила багато питань і бажання подивитися його ще раз, щоб розгадати всі приховані сенси. Рекомендую всім, хто любить фільми з глибоким підтекстом.",
    "reactions": [2, 3],
    "comments": [
      {
        "id": 10,
        "userId": "6",
        "content": "Дуже сильна історія, я навіть трохи плакала."
      }
    ],
    "countComments": 1,
    "countLikes": 24,
    "countDislikes": 4
  },
  {
    "id": 10,
    "userId": "9",
    "author": "Софія Матвієнко",
    "title": "Історія, яка надихає",
    "movieTitle": "До зірок",
    "date": "2024-03-15",
    "sentiment": "positive",
    "rating": 4.8,
    "content": "Цей фільм справив на мене сильне враження. Історія головного героя надихає і змушує вірити у власні сили. Візуальні ефекти були просто неймовірними, а музичний супровід ідеально підкреслював атмосферу. Особливо мене вразила кінцівка, яка змусила повірити, що все можливо, якщо докласти зусиль. Це один із найкращих фільмів, які я бачила цього року!",
    "reactions": [1, 4, 5],
    "comments": [
      {
        "id": 11,
        "userId": "8",
        "content": "Ця історія точно вартує перегляду!"
      }
    ],
    "countComments": 1,
    "countLikes": 32,
    "countDislikes": 1
  }
]
